package days03;

/**
 * @author geon
 * @date 2024. 1. 3. - 오후 3:28:30
 * @subject
 * @content
 */
public class Ex05 {

	public static void main(String[] args) {
		/*
		 * [연산자 우선 순위]
		 * 1) 단항 연산자	← 우측에서 좌측으로 진행
		 * 		~ ! (cast)
		 * 
		 * 2) 산술 연산자
		 * 		* / %
		 * 		+ -
		 * 		[비트] 쉬프트 연산자 >> <<
		 * 3) 비교연산자
		 * 		><>=<=		instanceof
		 * 		== !=
		 * 4) 논리연산자
		 * 		&
		 * 		^
		 * 		|
		 * 		&&
		 * 		||
		 * 5) 삼항(조건)연산자
		 * 	  항1 ? 항2 : 항3  ← 우측에서 좌측으로 진행
		 * 
		 * 6) 대입연산자 a=b=c=10     ← 우측에서 좌측으로 진행
		 * 		=					
		 * 		복합대입연산자
		 * 	+= 	-=	/=	%=	&=	|=	^= >>= <<= *=
		 * 
		 *  	
		 * 
		 * 
		 */
		
	}

}
