package days03;
/**
 * @author geon
 * @date 2024. 1. 3. - 오후 5:39:16
 * @subject	수식표현 : 연산자 사용
 * @content
 */
public class Ex10 {
	public static void main(String[] args) {

	    // 1) x는 10보다 크다. 
		//		x > 10
	    // 2) x는 10보다 크고, 20보다 작다. 
		//		x > 10 && x < 20
		// 3) x는 2의 배수이다.  
	    //		x % 2 == 0
	    // 4) x는 2의 배수 또는 3의 배수이다. 
		//		x % 2 == 0 || x % 3 == 0
	    // 5) x는 2의 배수이지만 6의 배수는 아니다. 
	    //		x % 2 == 0 && x % 6 !=0
	    // 6) 한 문자(ch)가  숫자이다.  
	    //		'ch' == '1'
	    // 7) 한 문자가 소문자이다. 
	    //		97 <= 'a' && 122 >= 'z'
	    // 8) 한 문자가 알파벳이다 ( 대문자이거나 또는 소문자 이니 ) 
		//		
	}

}
