package days25;

public class Ex02 {
	public static void main(String[] args) {
/*
 * [자바의 IO(Input + Output)] 
 * 			 입력 	  출력
 * 
 * 1.	[컴퓨터(프로그램)] --> 송신		[외부장치(다른프로그램)]
 * 						<--	수신
 * 		프로그램 간에 데이터를 주고 받는것 : 입출력
 * 
 * 2. 두 장치를 연결해주는 객체(길)이 필요하다. : 스트림(Stream)
 * 3. 스트림 : 데이터를 운반하는 통로.
 * 		1) 흐르는 물
 * 		2) 단방향 (2가지 스트림)
 * 			ㄱ. 읽기(입력용)스트림
 * 			ㄴ. 쓰기(출력용)스트림
 * 		3) 연속적인 데이터의 흐름
 * 4. 자바의 모든 입출력은 스트림이라는 개념으로 이루어져있다.
 * 
 *  예)
 *  
 *  	키보드장치		-> 수신 -> [프로그램] ->  송신	->	모니터
 *  	(표준입력장치)								   (표준출력장치)
 * 					스트림 객체			스트림객체
 * 					System.in			System.out
 * 
 * 5. 자바의 스트림은 2가지 종류 구분(분류)
 * 		1) 문자(텍스트) 스트림
 * 			최상위 부모 클래스 : Reader (입력)
 * 			최상위 부모 클래스 : Writer (출력)
 * 
 * 			1문자 == 유니코드 2바이트 == char
 * 			1문자, 문자열, 문자배열...
 * 
 * 
 * 			예) FileReader / FileWriter
 * 
 * 		2) 바이트(이진) 스트림
 * 			최상위 부모 클래스 : InputStream  (입력)
 * 			최상위 부모 클래스 : OutputStream (출력)
 * 			
 * 
 * 
 */
	}//m
}//c
