package days01;

/**
 * @author geon
 * @date 2023. 12. 29. - 오후 3:59:30
 * @subject
 * @content
 */
public class Ex03_02  {


	public static void main(String[] args) {
		// 상수
		/*1. 저장공간, 초기화하면 변경X
		 */
		// PI변수선언 -> 상수화 시킨다 -> 상수
		// const 상수
		 
		double pi = 3.141592;
		 
		 /*수학관련 코딩
		 * 수학관련 코딩 * 3.141592
		 * 수학관련 코딩
		 * 수학관련 코딩
		 * 수학관련 코딩
		 * 수학관련 * 3.141592 코딩
		 * 수학관련 코딩
		 * 수학관련 코딩
		 
		 

		 
		  수학관련 코 * 3.143592딩
		 * 수학관련 코딩
		 * 수학관련 코딩
		 * 수학 * 3.141592관련 코딩
		 * 수학관련 코딩
		 * 수학관련 코 * 3.141592딩
		 * 수학관련 코딩
		 * 수학관련 코딩
		 * 수학관련 코딩
		 * 수학관련 코딩
		 * 수학관 * 3.141592련 코딩
		 * */
	}

}