package days02;

/**
 * @author geon
 * @date 2024. 1. 2. - 오후 4:47:01
 * @subject
 * @content
 */
public class Ex11 {
	public static void main(String[] args) {
		// 실수형 float(4), double(8)
		// 정수형 int(4) long(8)
		float f; // 32비트 [부호비트 1][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][] 
		double d;//	64비트[부호비트 1][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][] 

		// [9.1234567]		10진수 실수-> 2진수 실수 변환 -> 정규화 -> 저장.
		//1001.000111111
		//1.
		// 가수(M)				지수(E) = 127 + 3 = 130
	}
}
